filoucool/Arduino_Code_Examples/lab_xbee/emetteur/dsPIC33FJ128GP802-51_lémetteur_ordenateur.c

/**********************************************************************
//   NOM DU PROGRAMME
//   Programme Prototype des controle des moteurs et des capteurs de présence
//   Mon version 46 dspic33fj128gp802 + PWM + ADC + c30 + PLLPRE +PLLDIV + PLLPOST :
//   AUTEUR:  
//   Mauricio Gomez + Philippe Connor + Antoine Langevin
//
//	 Modifier par : Antoine Langevin
//
//   DATE DE CRÉATION: 22 Marz 2011   
//
//
**********************************************************************/
#include "p33FJ128MC802.h"
#include <stdio.h>
#include <stdlib.h>
#include <math.h>
#include <outcompare.h> 
#include <timer.h> 
#include <uart.h> 
#include <string.h>
  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
 //Configuration bits pour le dspic33fj128gp802   Mauricio Gomez + Philippe Connor                                                                 //
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
 _FBS( RBS_NO_RAM  & BSS_NO_BOOT_CODE & BWRP_WRPROTECT_OFF );
 // No Boot Ram & No Boot program Flash segment &  Write Protect :  Disabled
 _FSS( RSS_NO_RAM  & SSS_NO_FLASH & SWRP_WRPROTECT_OFF );
 // No Secure Ram & No Secure Segment & Write Protect :  Disabled
 _FGS( GSS_OFF & GCP_OFF  & GWRP_OFF);
 // code protect off & Code Protect: disabled & Write Protect:Disabled
 _FOSCSEL( FNOSC_FRCPLL & IESO_OFF );
 // Internal Fast RC (FRC) & Start-up device with user-selected oscillator source 
 _FOSC( POSCMD_NONE & OSCIOFNC_ON & IOL1WAY_OFF & FCKSM_CSDCMD );
 // Primary Oscillator Disabled (car interne) & OSC2 pin has digital I/O function 
 //&  Allow Multiple Re-configurations &  Both Clock Switching and Fail-Safe Clock Monitor are disabled
 _FWDT( FWDTEN_OFF );
 // Watchdog timer enabled/disabled by user software
 _FPOR( FPWRT_PWR1 &  ALTI2C_OFF & LPOL_OFF & HPOL_OFF & PWMPIN_ON); 
 // POR Timer Value: Disabled & I2C mapped to SDA1/SCL1 pins & PWM module low side output pins have 
 //active-low output polarity & PWM module high side output pins have active-low output polarity & 
 //PWM module pins ----->NOT<----- controlled by PWM module at device Reset
 _FICD( JTAGEN_OFF  );
 // JTAG is Disabled
 
  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
 //"DEFINES IMPORTANTS" pour le fonctionement  Mauricio Gomez + Philippe Connor                                                                   //
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

 #define dsPIC33FJ128MC802 // LE PIC QU'ON UTILISE
 #define FIN 7372800LL  // clock-frequecy in Hz with suffix LL (64-bit-long), eg. 32000000LL for 32MHz
 #define N1 2 //
 #define N2 4 // 2,4 ou 8
 #define M 50 //
 //calcul fosc et fcy
 #define FOSC  (FIN * (M/(N1*N2))) // FOSC = FIN* PLLDIV/(PLLPRE*PLLPOST)
 #define FCY (FOSC/2) //FCY = FOSC/2... MCU is running at FCY MIPS

					//((FCY/BAUDRATE)/16)-1=155      9200
					//((FCY/BAUDRATE)/16)-1=149      9600
					//((FCY/BAUDRATE)/16)-1=74       19200
					//((FCY/BAUDRATE)/16)-1=36       38400					
					//((FCY/BAUDRATE)/16)-1=24       57600
					//((FCY/BAUDRATE)/16)-1=12		 115200
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Vitesse de XBEE                                                                                                  //
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

 #define U1BRGVAL ((FCY/9600)/16)-1; //149/9600 pour le baud rate du uart1 XBEE

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Vitesse de RS232 ordenateur                                                                                                  //
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
 #define U2BRGVAL2 ((FCY/115200)/16)-1; // pour le baud rate du uart2 RS232 ordenateur


////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Vitesse de i2c                                                                                                  //
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
 #define I2C1BRGVAL (char)((FCY/100000.0)-(FCY/17895697.0));  // i2c Sascha http://ww1.microchip.com/downloads/en/AppNotes/01079A.pdf pag 3
// #define I2C1BRGVAL  ((FCY/100000)-(FCY/10000000)-(1));  // i2c Philippe + Serge Hould http://ww1.microchip.com/downloads/en/DeviceDoc/39702b.pdf pag 14

  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
 //verification pour les "DEFINES IMPORTANTS"    Mauricio Gomez + Philippe Connor                                                                  //
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////



//convertion pour respecter la datasheet
 #define ValueN1 (N1-2) //CLKDIVbits.PLLPRE = ValueN1; // PLL Phase Detector Input Divider bits (N1)
 #define ValueM (M-2) //PLLFBDbits.PLLDIV = ValueM;  // PLL divider (M=50)
 #if N2 == 8
 #define valueN2 0b11 //CLKDIVbits.PLLPOST = ValueN2; // PLL VCO Output Divider Select bits (N2)
 #elif N2 == 4
 #define ValueN2 0b01 //CLKDIVbits.PLLPOST = ValueN2; // PLL VCO Output Divider Select bits (N2)
 #elif N2 == 2
 #define valueN2 0b00 //CLKDIVbits.PLLPOST = ValueN2; // PLL VCO Output Divider Select bits (N2)
 #endif

//error if something important missing - Philippe Connor    
 #ifndef dsPIC33FJ128MC802
 #error "mauvais pic ??? Si tu utilise ce codes pour un autre pic, sa risque de ne pas marcher"
 #endif 
 //
 #ifndef N1
 #error "definir n1 svp...."
 #endif
 #ifndef N2
 #error "definir n2 svp...."
 #endif
 #ifndef M
 #error "definir m svp...."
 #endif

 #define PERIODE 1850
#define delay_ms(x) __delay32(((x*FCY)/1000L))    // delays x ms
#define delay_us(x) __delay32(((x*FCY)/1000000L))   // delays x us
#define delay_ns(x) __delay32(((x*FCY)/1000000000L))  // delays x ns
  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
 // PROTOTYPES FONTIONS et VARIABLE GLOBALES  Mauricio Gomez + Philippe Connor                                      //
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
unsigned int temp_count;
void Delay( unsigned int delay_count );
void Init_ADC( int amask );
int readADC( int ch);
int itoa_m(int val);
int atoi_m(int val);
int ch_sel;
int read_adc1=2000;
int read_adc2=2000;
int last_read_adc1=2000;
int last_read_adc2=2000;
int changement = 0;
int compteur_changement = 0;
int changement2 = 0;
int compteur_changement2 = 0;
int relai = 0;
int read_adc3=2000;
int read_adc4=2000;
int Canal=1;
int equilibre=2000;
int max=4000;
int sans=100;
int state=0;
int avant_aux;
/**********************************************************************************************************************
****************************************************     RS232     ******************************************************
**********************************************************************************************************************/
void PC_Write_Str(unsigned char *str, int len);
void PC_Write_Int(unsigned char *str, unsigned int ul, unsigned int length);
void Init_OSC(void);
void Init_UART1(void);
void Init_UART2(void);

/**********************************************************************************************************************
****************************************************     I2C (Sascha Francis)  ****************************************
**********************************************************************************************************************/

