filoucool/Arduino_Code_Examples/lab_xbee/emetteur/dsPIC33FJ128GP802-51_lémetteur_ordenateur.c
void init_I2C(void); 
void start_I2C(void);
void restart_I2C(void);
void stop_I2C(void);
void writeByte_I2C(unsigned char);
signed int readByte_I2C(void);
void idle_I2C(void);
unsigned int ACKStatus(void);
void NoAck_I2C(void);
void Ack_I2C(void);

/**********************************************************************************************************************
****************************************************     Nunchuk Mauricio Emilio  ****************************************
**********************************************************************************************************************/

void nunchuk_init (void);    //Mauricio Emilio  http://www.musclera.com/wii-nunchuk-demonstration/
void nunchuck_read(unsigned int* array);
unsigned int  rx_data[20];                  // Nunchuk data array
void __delay_ms_long(unsigned long cnt);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// définition des interruptions                                                                                                  //
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

void _ISR __attribute__((__no_auto_psv__)) _T2Interrupt(void);
void __attribute__((interrupt, no_auto_psv)) _U1RXInterrupt(void);
void __attribute__((interrupt, no_auto_psv)) _U2RXInterrupt(void);

int main (void)
{

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Init Remappable port 5 pour allumer un petit del                                                                                    //
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

	TRISBbits.TRISB4=0; // Led

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Init PLLPRE,PLLDIV,PLLPOST,                                                                                    //
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Init_OSC();

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Init UART1, UART2                                                                                              //
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
Init_UART1();
Init_UART2();

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Serial  UART 1                                                                                                 //
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
   
   //Serial  UART 1
   _RP11R=0b00011;//U1TX 00011 RPn tied to UART1 Transmit pin 18 RP11
   RPINR18bits.U1RXR=0xa;//UART1 Receive U1RX RPINR18 U1RXR<4:0> pin 17 RP10
 
   //Serial  UART 1
//   bit 4-0 U1RXR<4:0>: Assign UART1 Receive (U1RX) to the corresponding RPn pin
//   11111 = Input tied to VSS
//   11001 = Input tied to RP25
//   •
//   •
//   •
//   00001 = Input tied to RP1
//   00000 = Input tied to RP0
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Serial  UART 2                                                                                                 //
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

   _RP6R=0b00101;//U2TX 00101 RPn tied to UART2 Transmit pin 15 RP16
   RPINR19bits.U2RXR=0x7;//UART2 Receive U2RX RPINR19 U2RXR<4:0> pin 16 RP7   

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Initialisation du timer 2                                                                                                  //
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  
   T2CONbits.TON= 1;// active timer1
   T2CONbits.TCKPS = 3;// bit 5-4 TCKPS<1:0>: Timer1 Input Clock Prescale Select bits
                  //11 = 1:256
   //T2CONbits.TON= 1;// active timer1
   T2CONbits.TCS= 0; // Slectionne la source 
   PR2 =PERIODE;// période 
   // Clear counter
   T2CONbits.TON= 1;// active timer2
   TMR2 = 0;
   IPC1bits.T2IP = 2;// Interrupt priority 2 (med-low)
   IEC0bits.T2IE = 1;// active interrupt
 
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Initialisation du nunchuk                                                                                                  //
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	PORTBbits.RB4=0;
    delay_us(10);
    PORTBbits.RB4=1;
    delay_us(10);
    init_I2C();
    nunchuk_init ();
//	__delay_ms_long(500);
     while(1)
     {

     }
 
}//main


/**********************************************************************************************************************
***************************************************  Fonction I2C  Sascha Francis.*************************************
**********************************************************************************************************************/

void init_I2C (void)
{
	I2C1BRG = I2C1BRGVAL;     // We set te I2C speedat 100kHz	
	I2C1CON = 0x1200;       // Initialiaze the I2C1 Peripherial for Master Mode, 7-bit Slave Address and Slew Rate Control Disabled and leave the peripherial disabled
	I2C1RCV = 0x0000;       // Clear I2C1 Receive Buffer
	I2C1TRN = 0x0000;       // Clear I2C1 Transmit Buffer
	I2C1CONbits.I2CEN = 1;      // now we init the i2c module and it takes controle of sda/scl
//	delay_ms(100);
	idle_I2C();
} 

void start_I2C(void)
{
 idle_I2C();
 I2C1CONbits.SEN = 1;      //Initiate Start condition on SDAx and SCLx pins. Hardware clear at end of master Start sequence
  while (I2C1CONbits.SEN);     // Wait Duration of Start Condition
}
void restart_I2C(void)
{
 idle_I2C();
 I2C1CONbits.RSEN = 1;      // Initiate Repeated Start condition on SDAx and SCLx pins. Hardware clear at end of master Repeated Start sequence
 while (I2C1CONbits.RSEN);     // Wait Duration of Restart Condition
}

void stop_I2C(void)
{
 idle_I2C();
 I2C1CONbits.RCEN = 0;
 I2C1CONbits.PEN = 1;      //Initiate Stop condition on SDAx and SCLx pins. Hardware clear at end of master Stop sequence
 while (I2C1CONbits.PEN);     // Wait Duration of Stop Condition
}

void writeByte_I2C(unsigned char byte)
{
 idle_I2C();
 I2C1TRN = byte;       // Load Data byte Into I2C1 Transmitt Buffer

 while (I2C1STATbits.TBF);     // Wait for Transmit to Complete
}

signed int readByte_I2C(void)    //Sascha
{
 idle_I2C();
 I2C1CONbits.RCEN = 1;     //Sascha
 Nop();         //Sascha
 while(!I2C1STATbits.RBF);    //Sascha
 return(I2CRCV);       //Sascha
}

void idle_I2C(void)
{
 while (I2C1STATbits.TRSTAT);    // pendant que Master transmit is in progress (8 bits + ACK)
}

unsigned int ACKStatus(void)
{
	idle_I2C();
	return (!I2C1STATbits.ACKSTAT);   //Return Ack Status
}

void NoAck_I2C(void)
{
 idle_I2C();
 I2C1CONbits.ACKDT = 1;      //Set for No ACk
 I2C1CONbits.ACKEN = 1;     //Initiate Acknowledge sequence on SDAx and SCLx pins
 while(I2C1CONbits.ACKEN);     //wait for Acknowledgement to complete
 I2C1CONbits.ACKDT = 0;     // Set for Ack
}

