filoucool/Arduino_Code_Examples/lab_xbee/emetteur/dsPIC33FJ128GP802-51_lémetteur_ordenateur.c
void Ack_I2C(void)
{
 I2C1CONbits.ACKDT = 0;      //Set for ACk
 I2C1CONbits.ACKEN = 1;      //Initiate Acknowledge sequence on SDAx and SCLx pins
 while(I2C1CONbits.ACKEN);     //wait for Acknowledgement to complete
 idle_I2C();
}

/**********************************************************************************************************************
********************************************   Fonction Nunchuk         **********************************************
**********************************************************************************************************************/

void nunchuk_init (void)    //Mauricio Emilio
{
	start_I2C();
	writeByte_I2C(0xA4);   // Device 0x52
	writeByte_I2C(0xF0);   // 
	writeByte_I2C(0x55);   // 
	stop_I2C();
	start_I2C();
	writeByte_I2C(0xA4);   // Adress
	writeByte_I2C(0xFB);   // 
	writeByte_I2C(0x00);   // 
	stop_I2C();
}  

void nunchuck_read(unsigned int* array) {
  start_I2C();
  writeByte_I2C(0xA4);   //
  writeByte_I2C(0x00);   //
  stop_I2C();
  
  start_I2C();
  writeByte_I2C(0xA5);   //
  array[0] = readByte_I2C();
  Ack_I2C();
  array[1] = readByte_I2C();
  Ack_I2C();
  array[2] = readByte_I2C();
  Ack_I2C();
  array[3] = readByte_I2C();
  Ack_I2C();
  array[4] = readByte_I2C();
  Ack_I2C();
  array[5] = readByte_I2C();
  NoAck_I2C();
  stop_I2C();
}

void __delay_ms_long(unsigned long cnt) {
  while (cnt-- > 0) {
    delay_us(975); // Delay 1ms (has slight correction factor)
  }
}

void Init_OSC(void)
{ // Init des parametre des clocks (FIN * (M/(N1*N2)))  
 CLKDIVbits.PLLPRE = ValueN1;
 PLLFBDbits.PLLDIV = ValueM;
 CLKDIVbits.PLLPOST = ValueN2;
 //CLKDIVbits.DOZE=0b011;  ////011 = FCY/8 (default)   
 OSCTUN = 0; // Tune FRC oscillator, if FRC is used
 //RCONbits.SWDTEN = 0; // Disable Watch Dog Timer
 while(OSCCONbits.LOCK != 1) {}; // Wait for PLL to lock
}

void Init_UART1(void)
{
U1MODEbits.STSEL = 0; // 1 Stop bit
U1MODEbits.PDSEL = 0; // No Parity, 8 data bits
U1MODEbits.ABAUD = 0; // Auto-Baud Disabled
U1MODEbits.BRGH = 0; // Low Speed mode
U1BRG = U1BRGVAL;//BRGVAL; // BAUD Rate 
U1MODEbits.UARTEN = 1; // Enable UART
U1STAbits.UTXEN = 1; // Enable UART TX

U1BRG  = U1BRGVAL;         //Baud Rate Generator Prescaler
U1MODE = 0x8000;         // Reset UART to 8-n-1, alt pins, and enable 
U1MODEbits.UARTEN = 1; // Enable UART
U1STAbits.UTXEN = 1; // Enable UART TX   U1STA  = 0x0440;         // Reset status register and enable TX & RX
   
IPC2bits.U1RXIP = 4;    //set recieve interrupt priority to 4
IEC0bits.U1RXIE = 1;    //recieve interrupt enable
_U1RXIF=0;              // Clear UART RX Interrupt Flag
U1STAbits.URXISEL = 0;  //interrupt when any character is recieved}
}

void Init_UART2(void)
{

U2MODEbits.STSEL = 0; // 1 Stop bit
U2MODEbits.PDSEL = 0; // No Parity, 8 data bits
U2MODEbits.ABAUD = 0; // Auto-Baud Disabled
U2MODEbits.BRGH = 0; // Low Speed mode
U2BRG = U2BRGVAL2;//BRGVAL; // BAUD Rate 
U2MODEbits.UARTEN = 1; // Enable UART
U2STAbits.UTXEN = 1; // Enable UART TX   U2STA  = 0x0440;         // Reset status register and enable TX & RX
   
IPC7bits.U2RXIP = 7;    //set recieve interrupt priority to 7
IEC1bits.U2RXIE = 1;    //recieve interrupt enable
_U2RXIF=0;              // Clear UART RX Interrupt Flag
U2STAbits.URXISEL = 0;  //interrupt when any character is recieved}

}


void Delay( unsigned int delay_count ) 
{
   temp_count = delay_count +1;
   asm volatile("outer: dec _temp_count");   
   asm volatile("cp0 _temp_count");
   asm volatile("bra z, done");
   asm volatile("do #3200, inner" );   
   asm volatile("nop");
   asm volatile("inner: nop");
   asm volatile("bra outer");
   asm volatile("done:");
}



void Init_ADC( int amask )
{
   AD1PCFGL = amask;//select channel
   //bit 10 AD12B: 10-Bit or 12-Bit Operation Mode bit
   //1 = 12-bit, 1-channel ADC operation
   //0 = 10-bit, 4-channel ADC operation
   //bit 7-5 SSRC<2:0>: Sample Clock Source Select bits
   //111 = Internal counter ends sampling and starts conversion (auto-convert)
   //110 = Reserved
   //101 = Reserved
   //100 = GP timer (Timer5 for ADC1) compare ends sampling and starts conversion
   //011 = Reserved
   //010 = GP timer (Timer3 for ADC1) compare ends sampling and starts conversion
   //001 = Active transition on INT0 pin ends sampling and starts conversion
   //000 = Clearing sample bit ends sampling and starts conversion
   AD1CON1 = 0b0000010011100000; // automatic conversion start after sampling
   //AD1CON1 = 0b0000010000000000; // automatic conversion start after sampling
   AD1CSSL = 0b11111111; // scanning required
   //bit 10 CSCNA: Scan Input Selections for CH0+ during Sample A bit
   //1 = Scan inputs
   //0 = Do not scan inputs
   //bit 9-8 CHPS<1:0>: Selects Channels Utilized bits
   //When AD12B = 1, CHPS<1:0> is: U-0, Unimplemented, Read as ‘0’
   //1x = Converts CH0, CH1, CH2 and CH3
   //01 = Converts CH0 and CH1
   //00 = Converts CH0
   AD1CON2 = 0b0000000000000000; 
   AD1CON3 = 0b0001111100000010; // Tsamp = 32 x Tad; Tad=125ns
   AD1CON1bits.ADON = 1; // turn on the ADC
   }

int readADC( int ch)
{
   Delay(1);
   AD1CHS0 = ch; // 1. select analog input channel
   AD1CON1bits.SAMP = 1; // 2. start sampling
   Delay(1);
   while (!AD1CON1bits.DONE); // 5. wait for the conversion to complete
   return ADC1BUF0; // 6. read the conversion result
} // readADC

void _ISR __attribute__((__no_auto_psv__)) _T2Interrupt(void)
 {
	unsigned int btn_Z;              // Extract Z button bit
    unsigned int btn_C;           // Extract C button bit
TMR2 = 0;
//int i;
//char dato1;
//char dato2;
//char dato3;
//char dato4;
    PORTBbits.RB4=0;
    delay_us(10);
    PORTBbits.RB4=1;
    delay_us(10);
      
    // Compteur pour envoyer les données au moins tous les ms s'il n'y a pas de changement + Antoine Langevin
//    if(compteur_changement++ > 25)
//    {
//	    changement = 1;
//	    compteur_changement = 0;
//	}   
//	if(compteur_changement2++ > 2)
//    {
//	    changement2 = 1;
//	    compteur_changement2 = 0;
//	}   
	
	
   
