filoucool/Arduino_Code_Examples/lab_xbee/emetteur/dsPIC33FJ128GP802-51_lémetteur_ordenateur.c
     //T2IF: Timer2 Interrupt Flag Status bit   //1 = Interrupt request has occurred
                                      //0 = Interrupt request has not occurred
    IFS0bits.T2IF = 0;
    ch_sel=0b00000001;
    Init_ADC(ch_sel);      
    read_adc1=readADC(ch_sel);
    read_adc1=4096-read_adc1;
    ch_sel=0b00000100;
    Init_ADC(ch_sel);
    read_adc2=readADC(ch_sel);
    read_adc2=4096-read_adc2;
    
    // Vérification de changement pour envoyer les nouvelles valeurs + Antoine Langevin
//    if(last_read_adc1 <= 30 && last_read_adc1 + 30 < read_adc1) changement = 1;
//    else if(last_read_adc1 >= 993 && last_read_adc1 - 30 > read_adc1) changement = 1;
//    else if(last_read_adc1 + 30 < read_adc1 || last_read_adc1 - 30 > read_adc1) changement = 1;
//    
//    if(last_read_adc2 <= 30 && last_read_adc2 + 30 < read_adc2) changement = 1;
//    else if(last_read_adc2 >= 993 && last_read_adc2 - 30 > read_adc2) changement = 1;
//    else if(last_read_adc2 + 30 < read_adc2 || last_read_adc2 - 30 > read_adc2) changement = 1;
//	
	// S'il y a un changement + Antoine Langevin
//	if(changement & changement2)
//	{	
//		// Si la variable relai est à 1 c'est parce qu'il y a un relai + Antoine Langevin
//		if(relai)
//		{
//			dato1 = read_adc1 & 0x00ff;
//		    dato2 = (read_adc1  >> 8) & 0x00ff;
//			dato3 = read_adc2 & 0x00ff;
//		    dato4 = (read_adc2  >> 8) & 0x00ff;
//		    
//		    if (dato1==(char)0xf1)dato1=0xf0;
//		    if (dato1==(char)0xf2)dato1=0xf0;
//		    if (dato1==(char)0xf3)dato1=0xf0;
//		    if (dato2==(char)0xf1)dato2=0xf0;
//		    if (dato2==(char)0xf2)dato2=0xf0;
//		    if (dato2==(char)0xf3)dato2=0xf0;
//		    if (dato3==(char)0xf1)dato3=0xf0;
//		    if (dato3==(char)0xf2)dato3=0xf0;
//		    if (dato3==(char)0xf3)dato3=0xf0;
//		    if (dato4==(char)0xf1)dato4=0xf0;
//		    if (dato4==(char)0xf2)dato4=0xf0;
//		    if (dato4==(char)0xf3)dato4=0xf0;
//		    
//		    WriteUART1(0xF2);
//		    while(U1STAbits.UTXBF==1);
//		    WriteUART1(dato1);
//		    while(U1STAbits.UTXBF==1);
//		    WriteUART1(dato2);
//		    while(U1STAbits.UTXBF==1);
//		    WriteUART1(dato3);
//		    while(U1STAbits.UTXBF==1);
//		    WriteUART1(dato4);
//		    while(U1STAbits.UTXBF==1);
//		    WriteUART1(0xff);
//		    while(U1STAbits.UTXBF==1);
//		    
////			WriteUART2(0xF2);
////		    while(U2STAbits.UTXBF==1);
////		    WriteUART2(dato1);
////		    while(U2STAbits.UTXBF==1);
////		    WriteUART2(dato2);    
////		    
//		    last_read_adc1 = read_adc1;
//		    last_read_adc2 = read_adc2; 
//		}
//		else // Sinon nous avons le même code qu'à la version précédente
//		{
//
//
		    char dato3 = read_adc2 & 0x000000ff;
		    char dato4 = (read_adc2  >> 8) & 0x000000ff;
		    char dato1 = read_adc1 & 0x00ff;
		    char dato2 = (read_adc1  >> 8) & 0x00ff;
		
		    if (dato1==(char)0xfd)dato1=0xfc;
		    if (dato1==(char)0xfe)dato1=0xfc;
		    if (dato2==(char)0xfd)dato2=0xfc;
		    if (dato2==(char)0xfe)dato2=0xfc;
		    if (dato3==(char)0xfd)dato3=0xfc;
		    if (dato3==(char)0xfe)dato3=0xfc;
		    if (dato4==(char)0xfd)dato4=0xfc;
		    if (dato4==(char)0xfe)dato4=0xfc;
		
		    WriteUART1(0xfd);
		    while(U1STAbits.UTXBF==1);
		    WriteUART1(dato1);
		    while(U1STAbits.UTXBF==1);
		    WriteUART1(dato2);
		    while(U1STAbits.UTXBF==1);
		    WriteUART1(0xfe);
		    while(U1STAbits.UTXBF==1);
		    WriteUART1(dato3);
		    while(U1STAbits.UTXBF==1);
		    WriteUART1(dato4);
		    while(U1STAbits.UTXBF==1);
		    
//		    WriteUART2(0xF2);
//		    while(U2STAbits.UTXBF==1);
//		    WriteUART2(dato1);
//		    while(U2STAbits.UTXBF==1);
//		    WriteUART2(dato2);    
		    
		    last_read_adc1 = read_adc1;
		    last_read_adc2 = read_adc2;
//		} 
		
		nunchuck_read(rx_data);                        // Read data from nunchuk
		read_adc1=rx_data[2];
		
		unsigned char displayTitle1[6] = "adc1:\0"; 
		unsigned char  val[5] = "    "; // conteneur
		unsigned char displayTitle2[6] = "adc2:\0";
			strcpy(val,"    "); 
//		PC_Write_Str(displayTitle1, strlen(displayTitle1));
			PC_Write_Str("a", strlen("a"));
			PC_Write_Int(val,rx_data[0],4);
			PC_Write_Str("b", strlen("b"));
			
			strcpy(val,"    "); 
//		PC_Write_Str(displayTitle1, strlen(displayTitle1));
			PC_Write_Int(val,rx_data[1],4);
			PC_Write_Str("c", strlen("c"));
			
			strcpy(val,"    "); 
//		PC_Write_Str(displayTitle1, strlen(displayTitle1));
			PC_Write_Int(val,rx_data[2],4);
			PC_Write_Str("d", strlen("d"));						
			
			strcpy(val,"    "); 
//		PC_Write_Str(displayTitle1, strlen(displayTitle1));
			PC_Write_Int(val,rx_data[3],4);
			PC_Write_Str("e", strlen("e"));

			strcpy(val,"    "); 
//		PC_Write_Str(displayTitle1, strlen(displayTitle1));
			PC_Write_Int(val,rx_data[4],4);
			PC_Write_Str("f", strlen("f"));

    btn_Z = (rx_data[5] & 0b1) ^ 0b1;              // Extract Z button bit http://www.musclera.com/wii-nunchuk-demonstration/
    btn_C = (rx_data[5]>>1 & 0b1) ^ 0b1;           // Extract C button bit http://www.musclera.com/wii-nunchuk-demonstration/			

			strcpy(val,"    "); 
//		PC_Write_Str(displayTitle1, strlen(displayTitle1));
			PC_Write_Int(val,btn_Z,4);
			PC_Write_Str("g", strlen("g"));

			strcpy(val,"    "); 
//		PC_Write_Str(displayTitle1, strlen(displayTitle1));
			PC_Write_Int(val,btn_C,4);
			PC_Write_Str("h", strlen("h"));
			PC_Write_Str("\n\r\0", strlen("\n\r\0"));
									
								
//		strcpy(val,"    ");
//		PC_Write_Str(displayTitle2, strlen(displayTitle2));
//		PC_Write_Int(val,read_adc2,4);
//		PC_Write_Str("\n\r\0", strlen("\n\r\0"));


		changement = 0;
		changement2 = 0;
//	}
}

void PC_Write_Str(unsigned char *str, int len)
{
 int i = 0;
  while (i < len)
 {
 WriteUART2(str[i++]);
 while(U2STAbits.UTXBF==1);
 }
}


void PC_Write_Int(unsigned char *str, unsigned int ul, unsigned int length) // by Phil
{
 int inclol = length; // -- mod 1
   do 
 { 
 str[--length] = (ul % 10) + '0'; 
    ul = ul / 10;
 inclol--;
   } while (ul);  //leading blanks 
  
  while (inclol--)
  {
   str[--length] = ' ';
  } 
  strcat(str,"\0");
  PC_Write_Str(str, strlen(str));
  
