filoucool/Arduino_Code_Examples/lab_xbee/emetteur/dsPIC33FJ128GP802-51_lémetteur_ordenateur.c
}


void __attribute__((interrupt, no_auto_psv)) _U1RXInterrupt(void)
{	
	_U1RXIF=0;
	
	int code;
	
	code = ReadUART1();
		char displayTitle1[6] = "reciA"; 
		PC_Write_Str(displayTitle1, strlen(displayTitle1));
		PC_Write_Str("\n\r\0", strlen("\n\r\0"));
	if(code == 0xF1)
	{
		if(ReadUART1() == 0xF2)
		{
//			_RB4 = 0;
		}	
	}
}	
	static int M1Switch=0;
	static int M2Switch=0;
	int M1=0;
	int M2=0;

void __attribute__((interrupt, no_auto_psv)) _U2RXInterrupt(void)
{	
	char displayTitle2[2];
	char displayTitle1[2];
	static int inc=0;
	int aux=0;
	_U2RXIF=0;
	
	int code;
	char  val[5] = "    "; // conteneur
	
	code = ReadUART2();
	unsigned int prochendata=0;
		switch (code)
		{
		case 97:
				strcpy(displayTitle2,"a\0");
				PC_Write_Str(displayTitle2, strlen(displayTitle2));
				PC_Write_Str("\n\r\0", strlen("\n\r\0"));
				read_adc1=50;
				read_adc2=4000;
				prochendata=0;
				break;
		case 100:
				strcpy(displayTitle2,"d\0");
				PC_Write_Str(displayTitle2, strlen(displayTitle2));
				PC_Write_Str("\n\r\0", strlen("\n\r\0"));
				read_adc1=4000;
				read_adc2=50;
				prochendata=0;
				break;
		case 119:
				strcpy(displayTitle2,"w\0");
				PC_Write_Str(displayTitle2, strlen(displayTitle2));
				PC_Write_Str("\n\r\0", strlen("\n\r\0"));
				read_adc1=50;
				read_adc2=50;
				prochendata=0;
				break;
		case 120:
				strcpy(displayTitle2,"x\0");
				PC_Write_Str(displayTitle2, strlen(displayTitle2));
				PC_Write_Str("\n\r\0", strlen("\n\r\0"));
				read_adc1=4000;
				read_adc2=4000;
				prochendata=0;
				break;
		case 115://s
				strcpy(displayTitle2,"s\0");
				PC_Write_Str(displayTitle2, strlen(displayTitle2));
				PC_Write_Str("\n\r\0", strlen("\n\r\0"));
				read_adc1=2000;
				read_adc2=2000;
				prochendata=0;
				break;
		case 108://l
				//strcpy(displayTitle2,"l\0");
				//PC_Write_Str(displayTitle2, strlen(displayTitle2));
				//PC_Write_Str("\n\r\0", strlen("\n\r\0"));
				//read_adc1=2000;
				//read_adc2=2000;
				M1Switch=1;
				inc=0;
				break;
		case 114://r
				//strcpy(displayTitle2,"r\0");
				//PC_Write_Str(displayTitle2, strlen(displayTitle2));
				//PC_Write_Str("\n\r\0", strlen("\n\r\0"));
				//read_adc1=2000;
				//read_adc2=2000;
				M2Switch=2;
				inc=0;
				break;
		case 102://f
				//strcpy(displayTitle2,"f\0");
				//PC_Write_Str(displayTitle2, strlen(displayTitle2));
				//PC_Write_Str("\n\r\0", strlen("\n\r\0"));
				M1Switch=0;
				//M2Switch=0;
				inc=0;
				read_adc1=M1;
				//read_adc2=M2;
				M1=0;
				//M2=0;
				break;
		case 103://g
				//strcpy(displayTitle2,"g\0");
				//PC_Write_Str(displayTitle2, strlen(displayTitle2));
				//PC_Write_Str("\n\r\0", strlen("\n\r\0"));
				//M1Switch=0;
				M2Switch=0;
				inc=0;
				//read_adc1=M1;
				read_adc2=M2;
				//M1=0;
				M2=0;
				break;
		
		default:
				if(inc>3)
				{ 	
					break;
				}
					if(M1Switch==1){
					aux=atoi_m(code);
					if (inc==0) {M1=M1+(aux*1000);}
					if (inc==1) {M1=M1+(aux*100);}
					if (inc==2) {M1=M1+(aux*10);}
					if (inc==3) {M1=M1+(aux*1);}
					inc++;
				}
				if(M2Switch==2){
					aux=atoi_m(code);
					if (inc==0) {M2=M2+(aux*1000);}
					if (inc==1) {M2=M2+(aux*100);}
					if (inc==2) {M2=M2+(aux*10);}
					if (inc==3) {M2=M2+(aux*1);}
					inc++;
				}
				if((M2Switch!=2)&(M1Switch!=1))
				{
				inc=0;
				}
				code=0;
		
		break;
		}
}

int itoa_m(int val)
{
	if (val==0)return 48;
	if (val==1)return 49;
	if (val==2)return 50;
	if (val==3)return 51;
	if (val==4)return 52;
	if (val==5)return 53;
	if (val==6)return 54;
	if (val==7)return 55;
	if (val==8)return 56;
	if (val==9)return 57;
	if (val>9)return 43;
	if (val<0)return 45;
	return 0;
}
int atoi_m(int val)
{
	if (val==48)return 0;
	if (val==49)return 1;
	if (val==50)return 2;
	if (val==51)return 3;
	if (val==52)return 4;
	if (val==53)return 5;
	if (val==54)return 6;
	if (val==55)return 7;
	if (val==56)return 8;
	if (val==57)return 9;
	if (val>57)return 10;
	if (val<48)return 11;
	return 0;
}